#define _CRT_SECURE_NO_WARNINGS 1
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“* ”组成的直角三角形图
//案。
//多组输入，一个整数（2~20），表示直角三角形直角边的长度，即“ * ”的数量，也表示输出行数。
//针对每行输入，输出用“ * ”组成的对应长度的直角三角形，每个“ * ”后面有一个空格。
//4
//*
//**
//***
//****
#include<stdio.h>
//int main()
//{
//	int i = 0;
//	int j = 0;
//	int input = 0;
//	while (scanf("%d", &input) != EOF)
//	{
//		for (i = 0; i < input; i++)
//		{
//			for (j = 0; j <= i; j++)
//			{
//				printf("*");
//			}
//			printf("\n");
//		}
//
//	}
//	return 0;
//}
//KiKi学习了循环，BoBo老师给他出了一系列打印图案的练习，该任务是打印用“* ”组成的直角三角形图
//案。
//多组输入，一个整数（2~20），表示直角三角形直角边的长度，即“ * ”的数量，也表示输出行数。
//针对每行输入，输出用“ * ”组成的对应长度的直角三角形，每个“ * ”后面有一个空格。
//4
//****
//***
//**
//*
//int main()
//{
//	int i = 0;
//	int a = 0;
//	int j = 0;
//	while (scanf("%d", &a) != EOF)
//	{
//		for (i = 0; i < a; i++)
//		{
//
//			for (j=i ; j < a; j++)
//			{
//				printf("*");
//			}
//			printf("\n");
//		}
//	}
//	return 0;
//}
// 多组输入：
// 输出：
//        *  5行 8        1    5+4-1
//      * *      6        2
//    * * *      4        3
//  * * * *      2        4 
//* * * * *      0        5
//      *         6  1          3+2-1   2a-2
//     * *         4  2
//    * * *         2  3
//   * * * *         0  4
//int main()
//{
//	int n = 0;
//	while (scanf("%d", &n) != EOF)
//	{
//		int i = 0;
//		//行数控制
//		for (i = 0; i < n; i++)
//		{
//			//空格
//			int j = 0;
//			for (j = 0; j < n - 1 - i; j++)
//			{
//				printf(" ");
//			}
//			//*
//			for (j = 0; j <= i; j++)
//			{
//				printf("* ");
//			}
//			printf("\n");
//		}
//
//	}
//	return 0;
//}

int main()
{
	int n = 0;
	while (scanf("%d", &n) != EOF)
	{
		int i = 0;
		int j = 0;
		//行数
		for (i = 0; i < n; i++)
		{
			//一行
			for (j = 0; j < n; j++)
			{
				//   * //(1,1)(1,2)
				//  * *//(2,1)
				// * * *
				// 
				//行和列的和
				//这里可以把行数和列数标出来就能看明白
				if (i + j < n - 1)
				{
					printf(" ");
				}
				else
				{
					printf("* ");
				}
			}
			printf("\n");
		}
	}
	return 0;
}